#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_compute_managed_ssl_certificate.default: Refreshing state... [id=projects/cloudresume-380001/global/sslCertificates/cloud-resume-cert]
google_compute_global_address.default: Refreshing state... [id=projects/cloudresume-380001/global/addresses/resume]
google_storage_bucket.default: Refreshing state... [id=davidbour-cloud-resume]
google_project_service.firebase_database: Refreshing state... [id=cloudresume-380001/firebasedatabase.googleapis.com]
google_api_gateway_api.api_cfg: Refreshing state... [id=projects/cloudresume-380001/locations/global/apis/visitor-api-gateway]
google_firebase_project.default: Refreshing state... [id=projects/cloudresume-380001]
google_storage_bucket_iam_member.default: Refreshing state... [id=b/davidbour-cloud-resume/roles/storage.objectViewer/allUsers]
google_compute_backend_bucket.default: Refreshing state... [id=projects/cloudresume-380001/global/backendBuckets/cloud-resume-backend-bucket]
google_compute_url_map.default: Refreshing state... [id=projects/cloudresume-380001/global/urlMaps/http-lb]
google_api_gateway_api_config.api_cfg: Refreshing state... [id=projects/cloudresume-380001/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg]
google_compute_target_https_proxy.default: Refreshing state... [id=projects/cloudresume-380001/global/targetHttpsProxies/cloud-https-proxy]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/cloudresume-380001/global/forwardingRules/https-lb-forwarding-rule]
google_api_gateway_gateway.api_gw: Refreshing state... [id=projects/cloudresume-380001/locations/us-central1/gateways/visitor-api-gateway]
google_firebase_database_instance.default: Refreshing state... [id=projects/cloudresume-380001/locations/us-central1/instances/cloudresume-380001-default-rtdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # google_api_gateway_api_config.api_cfg must be replaced
+/- resource "google_api_gateway_api_config" "api_cfg" {
      ~ api_config_id        = "visitor-api-gateway-cfg" -> "visitor-api-gateway-cfg-1" # forces replacement
      + api_config_id_prefix = (known after apply)
      ~ display_name         = "visitor-api-gateway-cfg" -> (known after apply)
      ~ id                   = "projects/cloudresume-380001/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg" -> (known after apply)
      - labels               = {} -> null
      ~ name                 = "projects/650273226296/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg" -> (known after apply)
      ~ project              = "cloudresume-380001" -> (known after apply)
      ~ service_config_id    = "visitor-api-gateway-cfg-1mf1h5tfbl4dv" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ openapi_documents {
          ~ document {
              ~ contents = "IyBvcGVuYXBpMi1ydW4ueWFtbApzd2FnZ2VyOiAnMi4wJwppbmZvOgogIHRpdGxlOiB2aXNpdG9yLWFwaS1nYXRld2F5CiAgZGVzY3JpcHRpb246IEFQSSBHYXRld2F5IGZvciBDbG91ZCBSdW4KICB2ZXJzaW9uOiAxLjAuMApzY2hlbWVzOgogIC0gaHR0cHMKcHJvZHVjZXM6CiAgLSBhcHBsaWNhdGlvbi9qc29uCngtZ29vZ2xlLWJhY2tlbmQ6CiAgYWRkcmVzczogaHR0cHM6Ly92aXNpdG9yLWFwaS1kZW1uZmlkZzJhLXVjLmEucnVuLmFwcApwYXRoczoKICAvOgogICAgZ2V0OgogICAgICBzdW1tYXJ5OiBIb21lIFBhZ2UKICAgICAgb3BlcmF0aW9uSWQ6IG1haW4KICAgICAgcmVzcG9uc2VzOgogICAgICAgICcyMDAnOgogICAgICAgICAgZGVzY3JpcHRpb246IEEgc3VjY2Vzc2Z1bCByZXNwb25zZQogICAgICAgICAgc2NoZW1hOgogICAgICAgICAgICB0eXBlOiBzdHJpbmcKICAvdmlzaXRvcjoKICAgIGdldDoKICAgICAgc3VtbWFyeTogR2V0IHZpc2l0b3IgY291bnQKICAgICAgb3BlcmF0aW9uSWQ6IGdldF92aXNpdG9yCiAgICAgIHJlc3BvbnNlczoKICAgICAgICAnMjAwJzoKICAgICAgICAgIGRlc2NyaXB0aW9uOiBWaXNpdG9yIGNvdW50CiAgICAgICAgICBzY2hlbWE6CiAgICAgICAgICAgIHR5cGU6IHN0cmluZwogIC92aXNpdG9yOgogICAgcG9zdDoKICAgICAgc3VtbWFyeTogSW5jcmVhc2UgdmlzaXRvciBjb3VudAogICAgICBvcGVyYXRpb25JZDogc2V0X3Zpc2l0b3IKICAgICAgcmVzcG9uc2VzOgogICAgICAgICcyMDAnOgogICAgICAgICAgZGVzY3JpcHRpb246IEluY3JlYXNlIHZpc2l0b3IgY291bnQKICAgICAgICAgIHNjaGVtYToKICAgICAgICAgICAgdHlwZTogc3RyaW5n" -> "IyBvcGVuYXBpMi1ydW4ueWFtbApzd2FnZ2VyOiAnMi4wJwppbmZvOgogIHRpdGxlOiB2aXNpdG9yLWFwaS1nYXRld2F5CiAgZGVzY3JpcHRpb246IEFQSSBHYXRld2F5IGZvciBDbG91ZCBSdW4KICB2ZXJzaW9uOiAxLjAuMApzY2hlbWVzOgogIC0gaHR0cHMKcHJvZHVjZXM6CiAgLSBhcHBsaWNhdGlvbi9qc29uCngtZ29vZ2xlLWJhY2tlbmQ6CiAgYWRkcmVzczogaHR0cHM6Ly92aXNpdG9yLWFwaS1kZW1uZmlkZzJhLXVjLmEucnVuLmFwcApwYXRoczoKICAvOgogICAgZ2V0OgogICAgICBzdW1tYXJ5OiBIb21lIFBhZ2UKICAgICAgb3BlcmF0aW9uSWQ6IG1haW4KICAgICAgcmVzcG9uc2VzOgogICAgICAgICcyMDAnOgogICAgICAgICAgZGVzY3JpcHRpb246IEEgc3VjY2Vzc2Z1bCByZXNwb25zZQogICAgICAgICAgc2NoZW1hOgogICAgICAgICAgICB0eXBlOiBzdHJpbmcKICAvdmlzaXRvcjoKICAgIGdldDoKICAgICAgc3VtbWFyeTogR2V0IHZpc2l0b3IgY291bnQKICAgICAgb3BlcmF0aW9uSWQ6IGdldF92aXNpdG9yCiAgICAgIHJlc3BvbnNlczoKICAgICAgICAnMjAwJzoKICAgICAgICAgIGRlc2NyaXB0aW9uOiBWaXNpdG9yIGNvdW50CiAgICAgICAgICBzY2hlbWE6CiAgICAgICAgICAgIHR5cGU6IHN0cmluZwogICAgcG9zdDoKICAgICAgc3VtbWFyeTogSW5jcmVhc2UgdmlzaXRvciBjb3VudAogICAgICBvcGVyYXRpb25JZDogc2V0X3Zpc2l0b3IKICAgICAgcmVzcG9uc2VzOgogICAgICAgICcyMDAnOgogICAgICAgICAgZGVzY3JpcHRpb246IEluY3JlYXNlIHZpc2l0b3IgY291bnQKICAgICAgICAgIHNjaGVtYToKICAgICAgICAgICAgdHlwZTogc3RyaW5n" # forces replacement
                # (1 unchanged attribute hidden)
            }
        }
    }

  # google_api_gateway_gateway.api_gw will be updated in-place
  ~ resource "google_api_gateway_gateway" "api_gw" {
      ~ api_config       = "projects/650273226296/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg" -> (known after apply)
        id               = "projects/cloudresume-380001/locations/us-central1/gateways/visitor-api-gateway"
        name             = "projects/cloudresume-380001/locations/us-central1/gateways/visitor-api-gateway"
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*